[
  {
    "id": 1,
    "category": "دعاء دخول الخلاء",
    "text": "([بِسْمِ اللَّهِ] اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث).",
    "count": 1,
    "description": "يُقال عند دخول الخلاء (الحمام) لطلب الحماية من الشياطين والأذى، ويُستحب قول 'بسم الله' أولاً للبركة."
  },
  {
    "id": 2,
    "category": "دعاء الخروج من الخلاء",
    "text": "(غُفْرَانَكَ).",
    "count": 1,
    "description": "يُقال عند الخروج من الخلاء لشكر الله على نعمة قضاء الحاجة والتطهر، والاستغفار للتوبة من الذنوب."
  },
  {
    "id": 3,
    "category": "دعاء الذهاب إلى المسجد",
    "text": "(اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَمِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وَأَعْظِمْ لِي نُوراً، وَعَظِّم لِي نُوراً، وَاجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وَفِي بَشَرِي نُوراً)([اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي... وَنُوراً فِي عِظَامِي])[(وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً)][(وَهَبْ لِي نُوراً عَلَى نُورٍ)]",
    "count": 1,
    "description": "يُقال أثناء الذهاب إلى المسجد لطلب النور والهداية في القلب والجوارح، مما يعزز الإيمان والتقرب إلى الله."
  },
  {
    "id": 4,
    "category": "دعاء دخول المسجد",
    "text": "(يَبْدَأُ بِرِجْلِهِ الْيُمْنَى) ، وَيَقُولُ: ((أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ))  [بِسْمِ اللَّهِ، وَالصَّلَاةُ] [وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ]  ((اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)).",
    "count": 1,
    "description": "يُقال عند دخول المسجد مع تقديم الرجل اليمنى، لطلب الحماية من الشيطان وفتح أبواب رحمة الله."
  },
  {
    "id": 5,
    "category": "الدعاء إذا نزل مترلا في سفر أو غيره",
    "text": "((أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ)).",
    "count": 1,
    "description": "يُقال عند النزول في مكان أثناء السفر أو غيره للحماية من شرور المخلوقات بكلمات الله التامة."
  },
  {
    "id": 6,
    "category": "دعاء التعجب والأمر السار",
    "text": "((سُبْحَانَ اللَّهِ!)).",
    "count": 1,
    "description": "يُقال عند التعجب أو عند سماع أمر سار، تعبيراً عن تنزيه الله وتفاجؤ بالخير."
  },
  {
    "id": 7,
    "category": "دعاء التعجب والأمر السار",
    "text": "((اللَّهُ أَكْبَرُ!)).",
    "count": 1,
    "description": "يُقال عند التعجب أو الفرح بأمر سار، لتكبير الله والإقرار بعظمته."
  },
  {
    "id": 8,
    "category": "دعاء من خشي أن يصيب شيئا بعينه",
    "text": "((إِذَا رَأَى أَحَدُكُم مِنْ أَخِيهِ، أَوْ مِنْ نَفْسِهِ، أَوْ مِنْ مَالِهِ مَا يُعْجِبُهُ [فَلْيَدْعُ لَهُ بِالْبَرَكَةِ] فَإِنَّ الْعَيْنَ حَقٌّ)).",
    "count": 1,
    "description": "يُقال عند رؤية شيء يعجب للدعاء بالبركة، لحماية الشخص أو المال من أذى العين."
  },
  {
    "id": 9,
    "category": "الدعاء عند سماع صياح الديك ونهيق الحمار",
    "text": "((إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ؛ فَإِنَّهَا رَأَتْ مَلَكاً وَإِذَا سَمِعْتُمْ نَهِيقَ الْحِمَارِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيطَانِ؛ فَإِنَّهُ رَأَى شَيْطَاناً)).",
    "count": 1,
    "description": "يُقال عند سماع صياح الديك لسؤال فضل الله، وعند نهيق الحمار للاستعاذة من الشيطان."
  },
  {
    "id": 10,
    "category": "دعاء نباح الكلاب بالليل",
    "text": "((إِذَا سَمِعْتُمْ نُبَاحَ الْكِلاَبِ وَنَهِيقَ الْحَمِيرِ بِاللَّيْلِ فَتَعَوَّذُوا بِاللَّهِ مِنْهُنَّ؛ فَإِنَّهُنَّ يَرَيْنَ مَا لاَ تَر ???(truncated 61829 characters)?????رَوْنَ)).",
    "count": 1,
    "description": "يُقال عند سماع نباح الكلاب أو نهيق الحمير ليلاً للاستعاذة من الشيطان، لأنها ترى ما لا يراه الإنسان."
  },
  {
    "id": 11,
    "category": "الدعاء لمن سببته",
    "text": "((اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ)).",
    "count": 1,
    "description": "يُقال إذا ساب شخص مؤمن، ليصبح ذلك وسيلة لتقريبه إلى الله يوم القيامة."
  },
  {
    "id": 12,
    "category": "دعاء الوقوف على الصفا والمروة",
    "text": "لَمَّا دَنَا النَّبِيُّ صلى الله عليه وسلم مِنَ الصَّفَا قَرَأَ: ﴿إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآئِرِ اللَّهِ﴾ أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ)) فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ، فَاسْتَقْبَلَ الْقِبْلَةَ، فَوَحَّدَ اللَّهَ وَكبَّرَهُ وَقَالَ: ((لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذلكَ. قَالَ مِثْلَ هَذَا ثَلاَثَ مَرَّاتٍ)) الْحَدِيثُ. وَفِيهِ: ((فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا)).",
    "count": 1,
    "description": "يُقال أثناء الوقوف على الصفا والمروة أثناء الحج أو العمرة، لتأكيد التوحيد والتكبير والدعاء بالخير."
  },
  {
    "id": 13,
    "category": "الدعاء يوم عرفة",
    "text": "((خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ، وَخَيْرُ مَا قُلْتُ أَنَا وَالنَّبيُّونَ مِنْ قَبْلِي: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ)).",
    "count": 1,
    "description": "يُعتبر أفضل دعاء يوم عرفة، يُقال لتأكيد التوحيد والحمد لله، ويُستحب في هذا اليوم العظيم للمغفرة والرحمة."
  },
  {
    "id": 14,
    "category": "ما يقول من أحس وجعا في جسده",
    "text": "((ضَعْ يَدَكَ عَلَى الَّذِي تَألَّمَ مِنْ جَسَدِكَ وَقُلْ: بِسْمِ اللَّهِ، ثَلاَثاً، وَقُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ)).",
    "count": 1,
    "description": "يُقال عند الشعور بألم في الجسد، بوضع اليد على مكان الألم للاستشفاء بالله والحماية من الشر."
  },
  {
    "id": 15,
    "category": "ما يقول عند الذبح أو النحر",
    "text": "((بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ وَلَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي)).",
    "count": 1,
    "description": "يُقال أثناء الذبح أو النحر لتكون القربان مقبولاً عند الله، مع ذكر اسم الله والتكبير."
  }
]